## Plan Result (test-test)




<pre><code>Plan: 16 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.api-internal.azurerm_private_dns_zone.zone[0]
  * module.api-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;bastion-nonprod-vnet&#34;]
  * module.api-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;core-infra-vnet-idam-perftest-internal&#34;]
  * module.api-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;core-infra-vnet-mgmt&#34;]
  * module.api-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;core-infra-vnet-perftest-internal&#34;]
  * module.api-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;mgmt-infra-prod&#34;]
  * module.api-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;pet-stg-vnet&#34;]
  * module.api-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;reform-mgmt-core-vnet&#34;]
  * module.dropzone-internal.azurerm_private_dns_zone.zone[0]
  * module.dropzone-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;bastion-nonprod-vnet&#34;]
  * module.dropzone-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;core-infra-vnet-idam-perftest-internal&#34;]
  * module.dropzone-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;core-infra-vnet-mgmt&#34;]
  * module.dropzone-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;core-infra-vnet-perftest-internal&#34;]
  * module.dropzone-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;mgmt-infra-prod&#34;]
  * module.dropzone-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;pet-stg-vnet&#34;]
  * module.dropzone-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;reform-mgmt-core-vnet&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.api-internal.azurerm_private_dns_zone.zone[0] will be created
  + resource "azurerm_private_dns_zone" "zone" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "service.core-compute-idam-perftest.internal"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "core-infra-intsvc-rg"
      + tags                                                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "testing"
        }

      + soa_record {
          + email         = (known after apply)
          + expire_time   = (known after apply)
          + fqdn          = (known after apply)
          + host_name     = (known after apply)
          + minimum_ttl   = (known after apply)
          + refresh_time  = (known after apply)
          + retry_time    = (known after apply)
          + serial_number = (known after apply)
          + tags          = (known after apply)
          + ttl           = (known after apply)
        }
    }

  # module.api-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link["bastion-nonprod-vnet"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "bastion-nonprod-vnet"
      + private_dns_zone_name = "service.core-compute-idam-perftest.internal"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "testing"
        }
      + virtual_network_id    = "/subscriptions/b44eb479-9ae2-42e7-9c63-f3c599719b6f/resourceGroups/bastion-nonprod-rg/providers/Microsoft.Network/virtualNetworks/bastion-nonprod-vnet"
    }

  # module.api-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link["core-infra-vnet-idam-perftest-internal"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "core-infra-vnet-idam-perftest-internal"
      + private_dns_zone_name = "service.core-compute-idam-perftest.internal"
      + registration_enabled  = true
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "testing"
        }
      + virtual_network_id    = "/subscriptions/7a4e3bd5-ae3a-4d0c-b441-2188fee3ff1c/resourceGroups/core-infra-idam-perftest/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-idam-perftest"
    }

  # module.api-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link["core-infra-vnet-mgmt"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "core-infra-vnet-mgmt"
      + private_dns_zone_name = "service.core-compute-idam-perftest.internal"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "testing"
        }
      + virtual_network_id    = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/rg-mgmt/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-mgmt"
    }

  # module.api-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link["core-infra-vnet-perftest-internal"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "core-infra-vnet-perftest-internal"
      + private_dns_zone_name = "service.core-compute-idam-perftest.internal"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "testing"
        }
      + virtual_network_id    = "/subscriptions/7a4e3bd5-ae3a-4d0c-b441-2188fee3ff1c/resourceGroups/core-infra-perftest/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-perftest"
    }

  # module.api-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link["mgmt-infra-prod"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "mgmt-infra-prod"
      + private_dns_zone_name = "service.core-compute-idam-perftest.internal"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "testing"
        }
      + virtual_network_id    = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/mgmt-infra-prod/providers/Microsoft.Network/virtualNetworks/mgmt-infra-prod"
    }

  # module.api-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link["pet-stg-vnet"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "pet-stg-vnet"
      + private_dns_zone_name = "service.core-compute-idam-perftest.internal"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "testing"
        }
      + virtual_network_id    = "/subscriptions/58a2ce36-4e09-467b-8330-d164aa559c68/resourceGroups/pet_stg_network_resource_group/providers/Microsoft.Network/virtualNetworks/pet_stg_network"
    }

  # module.api-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link["reform-mgmt-core-vnet"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "reform-mgmt-core-vnet"
      + private_dns_zone_name = "service.core-compute-idam-perftest.internal"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "testing"
        }
      + virtual_network_id    = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtCoreRG/providers/Microsoft.Network/virtualNetworks/reformMgmtCoreVNet"
    }

  # module.dropzone-internal.azurerm_private_dns_zone.zone[0] will be created
  + resource "azurerm_private_dns_zone" "zone" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "service.core-compute-idam-perftest.internal"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "core-infra-intsvc-rg"
      + tags                                                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "testing"
        }

      + soa_record {
          + email         = (known after apply)
          + expire_time   = (known after apply)
          + fqdn          = (known after apply)
          + host_name     = (known after apply)
          + minimum_ttl   = (known after apply)
          + refresh_time  = (known after apply)
          + retry_time    = (known after apply)
          + serial_number = (known after apply)
          + tags          = (known after apply)
          + ttl           = (known after apply)
        }
    }

  # module.dropzone-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link["bastion-nonprod-vnet"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "bastion-nonprod-vnet"
      + private_dns_zone_name = "service.core-compute-idam-perftest.internal"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "testing"
        }
      + virtual_network_id    = "/subscriptions/b44eb479-9ae2-42e7-9c63-f3c599719b6f/resourceGroups/bastion-nonprod-rg/providers/Microsoft.Network/virtualNetworks/bastion-nonprod-vnet"
    }

  # module.dropzone-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link["core-infra-vnet-idam-perftest-internal"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "core-infra-vnet-idam-perftest-internal"
      + private_dns_zone_name = "service.core-compute-idam-perftest.internal"
      + registration_enabled  = true
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "testing"
        }
      + virtual_network_id    = "/subscriptions/7a4e3bd5-ae3a-4d0c-b441-2188fee3ff1c/resourceGroups/core-infra-idam-perftest/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-idam-perftest"
    }

  # module.dropzone-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link["core-infra-vnet-mgmt"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "core-infra-vnet-mgmt"
      + private_dns_zone_name = "service.core-compute-idam-perftest.internal"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "testing"
        }
      + virtual_network_id    = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/rg-mgmt/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-mgmt"
    }

  # module.dropzone-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link["core-infra-vnet-perftest-internal"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "core-infra-vnet-perftest-internal"
      + private_dns_zone_name = "service.core-compute-idam-perftest.internal"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "testing"
        }
      + virtual_network_id    = "/subscriptions/7a4e3bd5-ae3a-4d0c-b441-2188fee3ff1c/resourceGroups/core-infra-perftest/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-perftest"
    }

  # module.dropzone-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link["mgmt-infra-prod"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "mgmt-infra-prod"
      + private_dns_zone_name = "service.core-compute-idam-perftest.internal"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "testing"
        }
      + virtual_network_id    = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/mgmt-infra-prod/providers/Microsoft.Network/virtualNetworks/mgmt-infra-prod"
    }

  # module.dropzone-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link["pet-stg-vnet"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "pet-stg-vnet"
      + private_dns_zone_name = "service.core-compute-idam-perftest.internal"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "testing"
        }
      + virtual_network_id    = "/subscriptions/58a2ce36-4e09-467b-8330-d164aa559c68/resourceGroups/pet_stg_network_resource_group/providers/Microsoft.Network/virtualNetworks/pet_stg_network"
    }

  # module.dropzone-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link["reform-mgmt-core-vnet"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "reform-mgmt-core-vnet"
      + private_dns_zone_name = "service.core-compute-idam-perftest.internal"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "testing"
        }
      + virtual_network_id    = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtCoreRG/providers/Microsoft.Network/virtualNetworks/reformMgmtCoreVNet"
    }

Plan: 16 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":469,"Program":"tfcmt","SHA1":"","Target":"test-test","Vars":{}} -->